Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PipeTransitionPreferenceTable::Modifier Class Reference
MEP Element Manager
Modifier of the PipeTransitionPreferenceTable. More...
#include <MEPPipeTransitionPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::PipeTransitionPreferenceTable::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewRow (const Key &key)
Inserts a new row into the table.
Result< void >  | DeleteRow (uint32_t index)
Deletes a row from the table.
Result< void >  | DeleteRowByKey (const Key &key)
Deletes a row from the table.
Result< void >  | SetBeginDiameter (uint32_t index, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetBeginDiameterByKey (const Key &key, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetEndDiameter (uint32_t index, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetEndDiameterByKey (const Key &key, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetLength (uint32_t index, double length)
Sets the length value of a table's row.
Result< void >  | SetLengthByKey (const Key &key, double length)
Sets the length value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByKey (const Key &key, const GS::UniString &description)
Sets the description of a table's row.
 Protected Member Functions
Modifier (PipeTransitionPreferenceTable &parent)
Constructs a Modifier with the given PipeTransitionPreferenceTable.
Detailed Description
Modifier of the PipeTransitionPreferenceTable.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::Modifier  |  ( |  PipeTransitionPreferenceTable & |  parent | )
protected
Constructs a Modifier with the given PipeTransitionPreferenceTable.
Parameters
parent | The given PipeTransitionPreferenceTable.
Member Function Documentation
◆ AddNewRow()
 Result< uint32_t > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::AddNewRow  |  ( |  const Key & |  key | )
Inserts a new row into the table.
Parameters
key | The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
If endReferenceId is larger than the beginReferenceId, the two values will be swapped before insertion.
Returns
Returns error if the pair of referenceIds is already present in the table, otherwise the index of the new row.
◆ DeleteRow()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::DeleteRow  |  ( |  uint32_t |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ DeleteRowByKey()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::DeleteRowByKey  |  ( |  const Key & |  key | )
Deletes a row from the table.
Parameters
key | The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise nothing.
◆ SetBeginDiameter()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetBeginDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the begin diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the end diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetBeginDiameterByKey()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetBeginDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the begin diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId from the key is not in the PipeReferenceSet;
if the end diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetDescription()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetDescription  |  ( |  uint32_t |  index,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByKey()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetDescriptionByKey  |  ( |  const Key & |  key,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
key | The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
description | The description to be set.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns error if at least one referenceId from the key is not in the PipeReferenceSet, otherwise nothing.
◆ SetEndDiameter()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetEndDiameter  |  ( |  uint32_t |  index,
|  double |  diameter )
Sets the end diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the begin diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetEndDiameterByKey()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetEndDiameterByKey  |  ( |  const Key & |  key,
|  double |  diameter )
Sets the end diameter value of a table's row.
Parameters
key | The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
diameter | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId from the key is not in the PipeReferenceSet;
if the begin diameter and length are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetLength()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetLength  |  ( |  uint32_t |  index,
|  double |  length )
Sets the length value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
length | The value to be set. Must be a non-zero positive number.
Returns
Returns nothing if the operation was successful, or returns error:
if the index is out of range;
if the begin diameter and end diameter are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetLengthByKey()
 Result< void > ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetLengthByKey  |  ( |  const Key & |  key,
|  double |  length )
Sets the length value of a table's row.
Parameters
key | The key that uniquely identifies a row in the PipeTransitionPreferenceTable.
length | The value to be set. Must be a non-zero positive number.
If no row exists for the given key, but the key contains valid referenceIds, it inserts the row.
Returns
Returns nothing if the operation was successful, or returns error:
if at least one referenceId from the key is not in the PipeReferenceSet;
if the begin diameter and end diameter are already defined, and the calculation of the transition angle is not between [1, 89] degrees.
◆ SetName()
 void ACAPI::MEP::PipeTransitionPreferenceTable::Modifier::SetName  |  ( |  const GS::UniString & |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.